<?php
require("../../inc/header.php");

/*
		SoftName : EmpireBak Version 2010
		Author   : wm_chief
		Copyright: Powered by www.phome.net
*/

DoSetDbChar('utf8');
E_D("DROP TABLE IF EXISTS `ecs_account_log`;");
E_C("CREATE TABLE `ecs_account_log` (
  `log_id` mediumint(8) unsigned NOT NULL auto_increment,
  `user_id` mediumint(8) unsigned NOT NULL,
  `user_money` decimal(10,2) NOT NULL,
  `frozen_money` decimal(10,2) NOT NULL,
  `rank_points` mediumint(9) NOT NULL,
  `pay_points` mediumint(9) NOT NULL,
  `change_time` int(10) unsigned NOT NULL,
  `change_desc` varchar(255) NOT NULL,
  `change_type` tinyint(3) unsigned NOT NULL,
  PRIMARY KEY  (`log_id`),
  KEY `user_id` (`user_id`)
) ENGINE=MyISAM AUTO_INCREMENT=115 DEFAULT CHARSET=utf8");
E_D("replace into `ecs_account_log` values('1','5','1100000.00','0.00','0','0','1242140736','11','2');");
E_D("replace into `ecs_account_log` values('2','3','400000.00','0.00','0','0','1242140752','21312','2');");
E_D("replace into `ecs_account_log` values('3','2','300000.00','0.00','0','0','1242140775','300000','2');");
E_D("replace into `ecs_account_log` values('4','1','50000.00','0.00','0','0','1242140811','50','2');");
E_D("replace into `ecs_account_log` values('5','5','0.00','10000.00','0','0','1242140853','32','2');");
E_D("replace into `ecs_account_log` values('6','1','-400.00','0.00','0','0','1242142274','支付订单 2009051298180','99');");
E_D("replace into `ecs_account_log` values('7','1','-975.00','0.00','0','0','1242142324','支付订单 2009051255518','99');");
E_D("replace into `ecs_account_log` values('8','1','0.00','0.00','960','960','1242142390','订单 2009051255518 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('9','1','0.00','0.00','385','385','1242142432','订单 2009051298180 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('10','1','-2310.00','0.00','0','0','1242142549','支付订单 2009051267570','99');");
E_D("replace into `ecs_account_log` values('11','1','0.00','0.00','2300','2300','1242142589','订单 2009051267570 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('12','1','-5989.00','0.00','0','0','1242142681','支付订单 2009051230249','99');");
E_D("replace into `ecs_account_log` values('13','1','-8610.00','0.00','0','0','1242142808','支付订单 2009051276258','99');");
E_D("replace into `ecs_account_log` values('14','1','0.00','0.00','0','-1','1242142910','参加夺宝奇兵夺宝奇兵之夏新N7 ','99');");
E_D("replace into `ecs_account_log` values('15','1','0.00','0.00','0','-1','1242142935','参加夺宝奇兵夺宝奇兵之诺基亚N96 ','99');");
E_D("replace into `ecs_account_log` values('16','1','0.00','0.00','0','100000','1242143867','奖励','2');");
E_D("replace into `ecs_account_log` values('17','1','-10.00','0.00','0','0','1242143920','支付订单 2009051268194','99');");
E_D("replace into `ecs_account_log` values('18','1','0.00','0.00','0','-17000','1242143920','支付订单 2009051268194','99');");
E_D("replace into `ecs_account_log` values('19','1','0.00','0.00','-960','-960','1242144185','由于退货或未发货操作，退回订单 2009051255518 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('20','1','975.00','0.00','0','0','1242144185','由于取消、无效或退货操作，退回支付订单 2009051255518 时使用的预付款','99');");
E_D("replace into `ecs_account_log` values('21','1','0.00','0.00','960','960','1242576445','订单 2009051719232 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('22','3','-1000.00','0.00','0','0','1242973612','追加使用余额支付订单：2009051227085','99');");
E_D("replace into `ecs_account_log` values('23','1','-13806.60','0.00','0','0','1242976699','支付订单 2009052224892','99');");
E_D("replace into `ecs_account_log` values('24','1','0.00','0.00','14045','14045','1242976740','订单 2009052224892 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('25','1','0.00','0.00','-2300','-2300','1245045334','由于退货或未发货操作，退回订单 2009051267570 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('26','1','2310.00','0.00','0','0','1245045334','由于取消、无效或退货操作，退回支付订单 2009051267570 时使用的预付款','99');");
E_D("replace into `ecs_account_log` values('27','1','0.00','0.00','17044','17044','1245045443','订单 2009061585887 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('28','1','17054.00','0.00','0','0','1245045515','1','99');");
E_D("replace into `ecs_account_log` values('29','1','0.00','0.00','-17044','-17044','1245045515','由于退货或未发货操作，退回订单 2009061585887 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('30','1','-3196.30','0.00','0','0','1245045672','支付订单 2009061525429','99');");
E_D("replace into `ecs_account_log` values('31','1','-1910.00','0.00','0','0','1245047978','支付订单 2009061503335','99');");
E_D("replace into `ecs_account_log` values('32','1','0.00','0.00','1900','1900','1245048189','订单 2009061503335 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('33','1','0.00','0.00','-1900','-1900','1245048212','由于退货或未发货操作，退回订单 2009061503335 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('34','1','1910.00','0.00','0','0','1245048212','由于取消、无效或退货操作，退回支付订单 2009061503335 时使用的预付款','99');");
E_D("replace into `ecs_account_log` values('35','1','-500.00','0.00','0','0','1245048585','支付订单 2009061510313','99');");
E_D("replace into `ecs_account_log` values('36','6','0.00','0.00','0','8388607','1402439037','1','2');");
E_D("replace into `ecs_account_log` values('37','6','0.00','0.00','327','327','1406141920','订单 2014070752549 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('38','6','0.00','0.00','1386','1386','1406141936','订单 2014060932408 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('39','3','0.00','0.00','2000','2000','1406141997','订单 2009051210718 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('40','3','0.00','0.00','623','623','1406142018','订单 2009051299732 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('41','3','0.00','0.00','-623','-623','1406142205','由于退货或未发货操作，退回订单 2009051299732 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('42','3','0.00','0.00','623','623','1406142208','订单 2009051299732 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('43','3','0.00','0.00','-2000','-2000','1406142212','由于退货或未发货操作，退回订单 2009051210718 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('44','3','0.00','0.00','2000','2000','1406142216','订单 2009051210718 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('45','6','0.00','0.00','-1386','-1386','1406142226','由于退货或未发货操作，退回订单 2014060932408 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('46','6','0.00','0.00','1386','1386','1406142229','订单 2014060932408 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('47','6','0.00','0.00','-327','-327','1406142238','由于退货或未发货操作，退回订单 2014070752549 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('48','6','0.00','0.00','327','327','1406142241','订单 2014070752549 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('49','6','0.00','0.00','488','488','1406763639','订单 2014073126550 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('50','6','0.00','0.00','8082','8082','1407369195','订单 2014080751421 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('51','6','0.00','0.00','26473','26473','1408039002','订单 2014081591904 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('52','6','0.00','0.00','-26473','-26473','1408317454','由于退货或未发货操作，退回订单 2014081591904 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('53','6','0.00','0.00','26473','26473','1408317460','订单 2014081591904 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('54','6','0.00','0.00','-8082','-8082','1408390265','由于退货或未发货操作，退回订单 2014080751421 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('55','6','0.00','0.00','8082','8082','1408390270','订单 2014080751421 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('56','6','0.00','0.00','-488','-488','1408390308','由于退货或未发货操作，退回订单 2014073126550 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('57','6','0.00','0.00','488','488','1408390312','订单 2014073126550 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('58','12','0.00','0.00','1799','1799','1408658928','订单 2014082262423 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('59','12','0.00','0.00','-1799','-1799','1408659524','由于退货或未发货操作，退回订单 2014082262423 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('60','12','0.00','0.00','0','0','1408659599','订单 2014082269446 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('61','12','0.00','0.00','1799','1799','1408664586','订单 2014082212404 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('62','12','0.00','0.00','1000','1000','1408919122','订单 2014082575928 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('63','12','0.00','0.00','1000','1000','1408919397','订单 2014082514319 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('64','12','0.00','0.00','128','128','1408919673','订单 2014082548343 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('65','12','0.00','0.00','100','100','1408919844','订单 2014082518482 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('66','12','0.00','0.00','0','10','1408919892','晒单奖励','99');");
E_D("replace into `ecs_account_log` values('67','12','100.00','0.00','0','0','1408993514','1','99');");
E_D("replace into `ecs_account_log` values('68','12','0.00','0.00','1000','1000','1409521125','订单 2014090104124 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('69','12','1003.50','0.00','0','0','1409521813','1','99');");
E_D("replace into `ecs_account_log` values('70','12','0.00','0.00','-1000','-1000','1409521813','由于退货或未发货操作，退回订单 2014090104124 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('71','12','0.00','0.00','1000','1000','1409522340','订单 2014090104124 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('72','12','0.00','0.00','-1000','-1000','1409522447','由于退货或未发货操作，退回订单 2014090104124 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('73','12','1003.50','0.00','0','0','1409522457','d','99');");
E_D("replace into `ecs_account_log` values('74','12','0.00','0.00','1000','1000','1409524487','订单 2014090104124 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('75','12','0.00','0.00','1000','1000','1409783454','订单 2014090147285 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('76','12','10000.00','0.00','0','0','1410198651','测试','2');");
E_D("replace into `ecs_account_log` values('77','12','-1003.50','0.00','0','0','1410198721','支付订单 2014090994636','99');");
E_D("replace into `ecs_account_log` values('78','12','-1202.50','0.00','0','0','1410198721','支付订单 2014090928005','99');");
E_D("replace into `ecs_account_log` values('79','12','-1003.50','0.00','0','0','1410200258','支付订单 2014090913528','99');");
E_D("replace into `ecs_account_log` values('80','12','-1003.50','0.00','0','0','1410200427','支付订单 2014090997141','99');");
E_D("replace into `ecs_account_log` values('81','12','-1202.50','0.00','0','0','1410200428','支付订单 2014090943497','99');");
E_D("replace into `ecs_account_log` values('82','12','-1003.50','0.00','0','0','1410200440','支付订单 2014090961549','99');");
E_D("replace into `ecs_account_log` values('83','12','-1202.50','0.00','0','0','1410200440','支付订单 2014090957849','99');");
E_D("replace into `ecs_account_log` values('84','12','-1003.50','0.00','0','0','1410200811','支付订单 2014090970750','99');");
E_D("replace into `ecs_account_log` values('85','12','-1202.50','0.00','0','0','1410200811','支付订单 2014090902192','99');");
E_D("replace into `ecs_account_log` values('86','12','-1003.50','0.00','0','0','1410201553','支付订单 2014090937607','99');");
E_D("replace into `ecs_account_log` values('87','12','-1202.50','0.00','0','0','1410201553','支付订单 2014090941651','99');");
E_D("replace into `ecs_account_log` values('88','12','10000.00','0.00','0','0','1410201641','飞','2');");
E_D("replace into `ecs_account_log` values('89','12','-1003.50','0.00','0','0','1410201649','支付订单 2014090928355','99');");
E_D("replace into `ecs_account_log` values('90','12','-1202.50','0.00','0','0','1410201649','支付订单 2014090994533','99');");
E_D("replace into `ecs_account_log` values('91','12','0.00','0.00','1000','1000','1410826410','订单 2014091675618 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('92','12','0.00','0.00','100','100','1411343804','订单 2014092238517 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('93','12','0.00','0.00','1000','1000','1413423340','订单 2014101491274 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('94','12','0.00','0.00','1000','1000','1413424206','订单 2014101610050 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('95','12','0.00','0.00','1000','1000','1416867135','订单 2014101610050 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('96','30','0.00','0.00','1000','1000','1417386937','订单 2014120193022 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('97','30','0.00','0.00','100','100','1417395387','订单 2014120158859 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('98','12','0.00','0.00','100','100','1417550100','订单 2014120353029 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('99','12','0.00','0.00','2659','2659','1417550162','订单 2014120394551 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('100','30','0.00','0.00','100','100','1417555374','订单 2014120331701 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('101','30','0.00','0.00','1000','1000','1417560049','订单 2014120302208 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('102','30','0.00','0.00','1000','1000','1417561060','订单 2014120314257 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('103','30','0.00','0.00','4908','4908','1417568465','订单 2014120399486 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('104','30','0.00','0.00','-4908','-4908','1417568639','由于退货或未发货操作，退回订单 2014120399486 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('105','30','0.00','0.00','4908','4908','1417568646','订单 2014120399486 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('106','30','0.00','0.00','4908','4908','1417568689','订单 2014120399486 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('107','30','0.00','0.00','-4908','-4908','1417568718','由于退货或未发货操作，退回订单 2014120399486 赠送的积分','99');");
E_D("replace into `ecs_account_log` values('108','49','10000.00','0.00','0','0','1419449274','充值','0');");
E_D("replace into `ecs_account_log` values('109','44','20000.00','0.00','0','0','1419449294','充值','0');");
E_D("replace into `ecs_account_log` values('110','41','0.10','0.00','0','0','1419449303','充值','0');");
E_D("replace into `ecs_account_log` values('111','49','-55.00','0.00','0','0','1419457822','支付订单 2014122512317','99');");
E_D("replace into `ecs_account_log` values('112','49','-2010.00','0.00','0','0','1419459998','追加使用余额支付订单：2014122519538','99');");
E_D("replace into `ecs_account_log` values('113','49','-1015.00','0.00','0','0','1419460320','支付订单 2014122532669','99');");
E_D("replace into `ecs_account_log` values('114','49','-20.00','0.00','0','0','1419460369','追加使用余额支付订单：2014122458547','99');");

require("../../inc/footer.php");
?>