<?php
require("../../inc/header.php");

/*
		SoftName : EmpireBak Version 2010
		Author   : wm_chief
		Copyright: Powered by www.phome.net
*/

DoSetDbChar('utf8');
E_D("DROP TABLE IF EXISTS `ecs_ad`;");
E_C("CREATE TABLE `ecs_ad` (
  `ad_id` smallint(5) unsigned NOT NULL auto_increment,
  `position_id` smallint(5) unsigned NOT NULL default '0',
  `media_type` tinyint(3) unsigned NOT NULL default '0',
  `ad_name` varchar(60) NOT NULL default '',
  `ad_link` varchar(255) NOT NULL default '',
  `ad_code` text NOT NULL,
  `start_time` int(11) NOT NULL default '0',
  `end_time` int(11) NOT NULL default '0',
  `link_man` varchar(60) NOT NULL default '',
  `link_email` varchar(60) NOT NULL default '',
  `link_phone` varchar(60) NOT NULL default '',
  `click_count` mediumint(8) unsigned NOT NULL default '0',
  `enabled` tinyint(3) unsigned NOT NULL default '1',
  PRIMARY KEY  (`ad_id`),
  KEY `position_id` (`position_id`),
  KEY `enabled` (`enabled`)
) ENGINE=MyISAM AUTO_INCREMENT=113 DEFAULT CHARSET=utf8");
E_D("replace into `ecs_ad` values('1','1','0','首页幻灯片右侧广告','','1406069395976663452.jpg','1406016000','1566374400','','','','0','1');");
E_D("replace into `ecs_ad` values('2','2','0','首页幻灯片下方广告1','','1406075296317746743.jpg','1406016000','1534838400','','','','2','1');");
E_D("replace into `ecs_ad` values('3','2','0','首页幻灯片下方广告2','','1406075333261117788.jpg','1406016000','1566374400','','','','1','1');");
E_D("replace into `ecs_ad` values('4','2','0','首页幻灯片下方广告3','','1406075488120364315.jpg','1406016000','1566374400','','','','3','1');");
E_D("replace into `ecs_ad` values('5','2','0','首页幻灯片下方广告4','','1406075518187962629.jpg','1406016000','1534838400','','','','4','1');");
E_D("replace into `ecs_ad` values('6','2','0','首页幻灯片下方广告5','','1406075539410898820.jpg','1406016000','1534838400','','','','3','1');");
E_D("replace into `ecs_ad` values('7','2','0','首页幻灯片下方广告6','','1406075561451160436.jpg','1406016000','1537516800','','','','0','1');");
E_D("replace into `ecs_ad` values('8','2','0','首页幻灯片下方广告7','','1406075576056451124.jpg','1406016000','1534838400','','','','1','1');");
E_D("replace into `ecs_ad` values('9','2','0','首页幻灯片下方广告8','','1406075586572541448.jpg','1406016000','1534838400','','','','2','1');");
E_D("replace into `ecs_ad` values('10','2','0','首页幻灯片下方广告9','','1406075607383985070.jpg','1406016000','1534838400','','','','1','1');");
E_D("replace into `ecs_ad` values('11','3','0','活动广告（宽）','','1406137160774626433.jpg','1406102400','1534924800','','','','4','1');");
E_D("replace into `ecs_ad` values('12','4','0','生活橱窗广告1','#','1406151817737371204.jpg','1406102400','1534924800','雷朋太阳镜','低至199元','','15','1');");
E_D("replace into `ecs_ad` values('13','4','0','生活橱窗广告2','','1406152314690278003.jpg','1406102400','1566460800','夏新大V2X','999元秒杀','','13','1');");
E_D("replace into `ecs_ad` values('14','4','0','生活橱窗广告3','','1406152418152111165.jpg','1406102400','1534924800','精品周刊','华为好评冠军','','2','1');");
E_D("replace into `ecs_ad` values('15','4','0','生活橱窗广告4','','1406152505140580961.png','1406102400','1598083200','今日团购','年中好货盘点','','10','1');");
E_D("replace into `ecs_ad` values('16','4','0','生活橱窗广告5','','1406152550356090913.png','1406102400','1566460800','京东首发','雷神15.6寸本','','9','1');");
E_D("replace into `ecs_ad` values('17','4','0','生活橱窗广告6','','1406152580667368363.jpg','1406102400','1534924800','阿迪达斯','低至5折','','4','1');");
E_D("replace into `ecs_ad` values('18','4','0','生活橱窗广告7','','1406152606391214931.jpg','1406102400','1534924800','京东预售','八核待机王','','9','1');");
E_D("replace into `ecs_ad` values('19','4','0','生活橱窗广告8','','1406152655385236373.jpg','1406102400','1534924800','金融精选','理财齐争锋','','0','1');");
E_D("replace into `ecs_ad` values('20','6','0','活动广告（窄）','','1406164198827930394.jpg','1406102400','1598083200','','','','0','1');");
E_D("replace into `ecs_ad` values('21','8','0','图书、音像、数字商品左侧导航广告1','','1406507487757573574.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('22','8','0','图书、音像、数字商品左侧导航广告2','','1406507549772842084.jpg','1406448000','1503734400','','','','0','1');");
E_D("replace into `ecs_ad` values('23','8','0','家用电器左侧导航广告1','','1406507798515656211.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('24','8','0','家用电器左侧导航广告2','','1406507807879224820.jpg','1406448000','1566806400','','','','0','1');");
E_D("replace into `ecs_ad` values('25','8','0','手机、数码、京东通信左侧导航广告1','','1406507911373160367.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('26','8','0','手机、数码、京东通信左侧导航广告2','','1406507921443468263.jpg','1406448000','1566806400','','','','0','1');");
E_D("replace into `ecs_ad` values('27','8','0','电脑、办公左侧导航广告1','','1406507977838262814.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('28','8','0','电脑、办公左侧导航广告2','','1406507987063439272.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('29','8','0','家居、家具、家装、厨具左侧导航广告1','','1406508027905316135.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('30','8','0','家居、家具、家装、厨具左侧导航广告2','','1406508036272322498.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('31','8','0','服饰内衣、珠宝首饰左侧导航广告1','','1406508067194916470.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('32','8','0','服饰内衣、珠宝首饰左侧导航广告2','','1406508077876644184.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('33','8','0','个护化妆左侧导航广告1','','1406508112391967428.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('34','8','0','个护化妆左侧导航广告2','','1406508130996737332.jpg','1406448000','1566806400','','','','0','1');");
E_D("replace into `ecs_ad` values('35','8','0','鞋靴、箱包、钟表、奢侈品左侧导航广告1','','1406508162440542657.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('36','8','0','鞋靴、箱包、钟表、奢侈品左侧导航广告2','','1406508171917879753.jpg','1406448000','1537948800','','','','0','1');");
E_D("replace into `ecs_ad` values('37','8','0','运动户外左侧导航广告1','','1406508199941482276.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('38','8','0','运动户外左侧导航广告2','','1406508207442755780.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('39','8','0','汽车用品左侧导航广告1','','1406508240894630478.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('40','8','0','汽车用品左侧导航广告2','','1406508248220510502.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('41','8','0','母婴、玩具乐器左侧导航广告1','','1406508286389882108.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('42','8','0','母婴、玩具乐器左侧导航广告2','','1406508301774827640.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('43','8','0','食品饮料、酒类、生鲜左侧导航广告1','','1406508342376166801.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('44','8','0','食品饮料、酒类、生鲜左侧导航广告2','','1406508351450233476.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('45','8','0','营养保健左侧导航广告1','','1406508378979207734.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('46','8','0','营养保健左侧导航广告2','','1406508387459719001.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('47','9','0','家用电器分类下商品大广告1','','1408390453407257659.jpg','1406448000','1535270400','','','','1','1');");
E_D("replace into `ecs_ad` values('48','9','0','家用电器分类下商品大广告2','','1406508603532711054.jpg','1406448000','1503734400','','','','0','1');");
E_D("replace into `ecs_ad` values('49','9','0','家用电器分类下商品大广告3','','1406508625864050662.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('50','9','0','家用电器分类下商品大广告4','','1406508634628031049.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('51','10','0','家用电器分类下商品小广告1','','1406509668761947380.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('52','10','0','家用电器分类下商品小广告2','','1406509678587006162.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('53','9','0','电脑、办公分类下商品大广告1','','1406509752350555897.jpg','1406448000','1535270400','','','','3','1');");
E_D("replace into `ecs_ad` values('54','9','0','电脑、办公分类下商品大广告2','','1406509768884491279.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('55','9','0','电脑、办公分类下商品大广告3','','1406509776953284577.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('56','9','0','电脑、办公分类下商品大广告4','','1406509791220205879.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('57','10','0','电脑、办公分类下商品小广告1','','1407980323807897496.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('58','10','0','电脑、办公分类下商品小广告2','','1407980341786154804.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('59','9','0','服饰内衣、珠宝首饰分类下商品大广告1','','1408390512445805225.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('60','9','0','服饰内衣、珠宝首饰分类下商品大广告2','','1408390525263962578.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('61','9','0','服饰内衣、珠宝首饰分类下商品大广告3','','1408390539126741372.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('62','9','0','服饰内衣、珠宝首饰分类下商品大广告4','','1408390552159341988.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('63','10','0','服饰内衣、珠宝首饰分类下商品小广告1','','1407980222323891292.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('64','10','0','服饰内衣、珠宝首饰分类下商品小广告2','','1407980241521230280.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('65','9','0','个护化妆分类下商品大广告1','','1406510397613631178.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('66','9','0','个护化妆分类下商品大广告2','','1406510406534361842.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('67','9','0','个护化妆分类下商品大广告3','','1406510415852453498.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('68','9','0','个护化妆分类下商品大广告4','','1406510432051348265.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('69','10','0','个护化妆分类下商品小广告1','','1407980206975602864.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('70','10','0','个护化妆分类下商品小广告2','','1407980146479903358.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('71','9','0','家居、家具、家装、厨具分类下商品大广告1','','1406510632856465334.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('72','9','0','家居、家具、家装、厨具分类下商品大广告2','','1406510642064505703.jpg','1406448000','1569484800','','','','0','1');");
E_D("replace into `ecs_ad` values('73','9','0','家居、家具、家装、厨具分类下商品大广告3','','1406510651116907378.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('74','9','0','家居、家具、家装、厨具分类下商品大广告4','','1406510659677112617.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('75','10','0','家居、家具、家装、厨具分类下商品小广告1','','1407980393062502261.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('76','10','0','家居、家具、家装、厨具分类下商品小广告2','','1407980410784210913.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('77','9','0','母婴、玩具乐器分类下商品大广告1','','1406510812206345819.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('78','9','0','母婴、玩具乐器分类下商品大广告2','','1406510821550742767.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('79','9','0','母婴、玩具乐器分类下商品大广告3','','1406510829740969414.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('80','9','0','母婴、玩具乐器分类下商品大广告4','','1406510839703090377.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('81','10','0','母婴、玩具乐器分类下商品小广告1','','1407980496262890775.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('82','10','0','母婴、玩具乐器分类下商品小广告2','','1406510906487892891.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('83','9','0','营养保健分类下商品大广告1','','1406510985981706974.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('84','9','0','营养保健分类下商品大广告2','','1406510995518138110.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('85','9','0','营养保健分类下商品大广告3','','1406511006000313098.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('86','9','0','营养保健分类下商品大广告4','','1406511017240525561.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('87','10','0','营养保健分类下商品小广告1','','1407980471414680182.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('88','10','0','营养保健分类下商品小广告2','','1406511041498564354.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('89','9','0','图书、音像、数字商品分类下商品大广告1','','1406511088089170275.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('90','9','0','图书、音像、数字商品分类下商品大广告2','','1406511098850152351.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('91','9','0','图书、音像、数字商品分类下商品大广告3','','1406511106288753673.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('92','9','0','图书、音像、数字商品分类下商品大广告4','','1406511114397855739.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('93','10','0','图书、音像、数字商品分类下商品小广告1','','1406511125731627722.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('94','10','0','图书、音像、数字商品分类下商品小广告2','','1406511133023415286.jpg','1406448000','1535270400','','','','0','1');");
E_D("replace into `ecs_ad` values('95','11','0','家用电器顶级分类页幻灯片广告1','','1406766071715739694.jpg','1406707200','1535529600','','','','1','1');");
E_D("replace into `ecs_ad` values('96','11','0','家用电器顶级分类页幻灯片广告2','','1406766079097981550.jpg','1406707200','1535529600','','','','0','1');");
E_D("replace into `ecs_ad` values('97','11','0','家用电器顶级分类页幻灯片广告3','','1406766445342323882.jpg','1406707200','1535529600','','','','0','1');");
E_D("replace into `ecs_ad` values('98','11','0','家用电器顶级分类页幻灯片广告4','','1406766098212958781.jpg','1406707200','1535529600','','','','0','1');");
E_D("replace into `ecs_ad` values('99','11','0','家用电器顶级分类页幻灯片广告5','','1406766106006489813.jpg','1406707200','1535529600','','','','1','1');");
E_D("replace into `ecs_ad` values('100','12','0','顶部横幅广告（宽）','','1407957331704394598.jpg','1407916800','1536739200','','','','3','1');");
E_D("replace into `ecs_ad` values('101','13','0','顶部横幅广告（窄）','','1407957343988703228.jpg','1407916800','1536739200','','','','0','1');");
E_D("replace into `ecs_ad` values('102','14','0','家用电器分类下商品左广告','','1407979481537649680.jpg','1407916800','1536739200','','','','0','1');");
E_D("replace into `ecs_ad` values('103','14','0','电脑、办公分类下商品左广告','','1407979499998643185.jpg','1407916800','1568275200','','','','0','1');");
E_D("replace into `ecs_ad` values('104','14','0','服饰内衣、珠宝首饰分类下商品左广告','','1407979517938114299.jpg','1407916800','1536739200','','','','0','1');");
E_D("replace into `ecs_ad` values('105','14','0','个护化妆分类下商品左广告','','1407979544685008229.jpg','1407916800','1536739200','','','','0','1');");
E_D("replace into `ecs_ad` values('106','14','0','家居、家具、家装、厨具分类下商品左广告','','1407979568920659387.jpg','1407916800','1536739200','','','','1','1');");
E_D("replace into `ecs_ad` values('107','14','0','母婴、玩具乐器分类下商品左广告','','1407979587248728014.jpg','1407916800','1536739200','','','','0','1');");
E_D("replace into `ecs_ad` values('108','14','0','营养保健分类下商品左广告','','1407979760080639244.jpg','1407916800','1536739200','','','','0','1');");
E_D("replace into `ecs_ad` values('109','14','0','图书、音像、数字商品分类下商品左广告','','1407979672230626512.jpg','1407916800','1539331200','','','','0','1');");
E_D("replace into `ecs_ad` values('110','3','0','全友家居','','1416520630969230057.jpg','1416470400','1419062400','全友家居','全友家居','','0','1');");
E_D("replace into `ecs_ad` values('111','0','0','智能设备','','1419457541635972966.png','1419408000','1422000000','','','','0','1');");
E_D("replace into `ecs_ad` values('112','9','0','888','','1419457989578633895.jpg','1419408000','1422000000','','','','0','1');");

require("../../inc/footer.php");
?>